uhnp/src/Reports/ОтчетОКорректировках/ОтчетОКорректировках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОКорректировках</name>
  <attributes>
    <name>ЭкземплярОтчета</name>
    <type>
      <types>DocumentRef.НастраиваемыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПоказателей</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>тПериод</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Enums/ТипыЗначенийПоказателейОтчетов/ТипыЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/НастраиваемыйОтчет/НастраиваемыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастраиваемыйОтчет</name>
  <basedOn>Catalog.БланкиОтчетов</basedOn>
  <basedOn>Catalog.ВидыОтчетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОтчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечанияБланков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</name>
    <type>
      <types>EnumRef.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПроверки</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкИмпорта</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСвертывания</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВноситьИзменения</name>
    <comment>Не вносить изменения в отчет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭкземплярыИсточники</name>
    <attributes>
      <name>ЭкземплярОтчета</name>
      <type>
        <types>DocumentRef.НастраиваемыйОтчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/КорректировкаЗначенийПоказателей/КорректировкаЗначенийПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЗначенийПоказателей</name>
  <basedOn>Catalog.ШаблоныКорректировокЗначенийПоказателей</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКорректировки</name>
    <type>
      <types>CatalogRef.ШаблоныКорректировокЗначенийПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Сбалансированная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаКорректировки</name>
    <type>
      <types>EnumRef.СпособыВводаКорректировок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОрганизацийДляРаспределения</name>
    <type>
      <types>EnumRef.СпособыОбратногоРаспределения</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийДляАктуализации</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйПериод</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеРеквизиты</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>БазаРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректировкаСинтетика</name>
    <attributes>
      <name>ИдентификаторСинтетика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректировкаАналитика</name>
    <attributes>
      <name>ИдентификаторСинтетика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВалюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияДляРаспределения</name>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Reports/ОтчетОКорректировках/Forms/ФормаОтчетаУправляемая/Module.bsl
Перем ТаблицаЗначений;
Перем ТаблицаКорректировок;
Перем Линия;
Перем ЦветВерсии;
Перем ЦветКорректировки;
Перем ЦветВидОперации;
Перем Цвет;
Перем ШиринаКолонки;

Перем ЦветФонаОбластиЗаполняемогоПоказателя;
Перем ЦветФонаОбластиВычисляемогоПоказателя;
Перем СоответствиеРасположениеКорректировок;
Перем ТаблицаГруппировок;
Перем ТаблицаВерсий;

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ПолеТабличногоДокументаОтчет.Очистить();
	ЗаполнитьТаблицу();
КонецПроцедуры

Процедура ОформитьЯчейку(Область, Текст, Цвет, ШиринаКолонки, ОриентацияТекста, РазмерШрифта=8, Жирный=Истина)
	
	Область.СодержитЗначение = Ложь;
	Область.ШиринаКолонки = ШиринаКолонки;
	Область.Шрифт = Новый Шрифт(Область.Шрифт, , РазмерШрифта, Жирный);
	Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	Область.Текст = Текст;
	Область.ОриентацияТекста = ОриентацияТекста;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Область.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	Область.Обвести(Линия, Линия, Линия, Линия);
	Область.ЦветФона = Цвет;

	
КонецПроцедуры

Процедура ВывестиДеревоОпераций(ВидПоказателя, Строки, РядВывода, ТабличныйДокумент, ТекущийЦветФона)
	
	Для Каждого Строка Из Строки Цикл
		
		флПодчиненный = Ложь;
		Если Строка.Версия = NULL Тогда
			ВывестиДеревоОпераций(ВидПоказателя, Строка.Строки, РядВывода, ТабличныйДокумент,ТекущийЦветФона);
			КолонкаВывода = СоответствиеРасположениеКорректировок[Строка.Ссылка] + 1;
		Иначе
			КолонкаВывода = СоответствиеРасположениеКорректировок[Строка.Версия] + 1;
			Регистратор = Строка.Версия.Регистратор; 
			
			МассивТипов=Новый Массив;
			МассивТипов.Добавить("ДокументСсылка.Трансляция");
			МассивТипов.Добавить("ДокументСсылка.ТрансформационнаяКорректировка");
			МассивТипов.Добавить("ДокументСсылка.КорректировкаЗначенийПоказателей");
			
			Для Каждого СтрТип ИЗ МассивТипов Цикл
				
				Если ТипЗнч(Регистратор)=Тип(СтрТип) Тогда
					
					флПодчиненный = Истина;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если КолонкаВывода <> Неопределено Тогда
			КолонкаВывода = КолонкаВывода + 1;
			Если Строка.Версия <> NULL Тогда
				Расшифровка = Новый Структура("Показатель, Расшифровка", Строка.Показатель, Строка.Версия);
			Иначе
				Расшифровка = Неопределено;
			КонецЕсли;
			
			ТекОбласть  = ТабличныйДокумент.Область(РядВывода, КолонкаВывода, РядВывода, КолонкаВывода);
			ТекОбласть.Расшифровка = Расшифровка;
			ТекОбласть.СодержитЗначение = Истина;
			ТекОБласть.Значение         = Строка.ЗначениеЧисло;
			ТекОбласть.Обвести(Линия, Линия, Линия, Линия);
			ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТекОбласть.ЦветФона = ТекущийЦветФона;
			
			Если ЗначениеЗаполнено(ТекОбласть) Тогда
				ТекОбласть.Шрифт = Новый Шрифт(ТекОбласть.Шрифт, , , НЕ флПодчиненный);
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДеревоВидовОпераций(Строки, НачалоВывода, ТабличныйДокумент, ТаблицаЗначений)
	
	Для Каждого Строка Из Строки Цикл
		
		ТекОбласть = ТабличныйДокумент.Область(1, НачалоВывода, 2, НачалоВывода);
		ТекОбласть.Объединить();
		НачалоВывода     = НачалоВывода + 1;

		Если Строка.Версия <> NULL Тогда
			ТекСтрока = ТаблицаЗначений.Найти(Строка.Версия, "Версия");
			Регистратор = Строка.Версия.Регистратор;
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.Трансляция")
				ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ТрансформационнаяКорректировка")
				ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаЗначенийПоказателей")Тогда
				ТипРегистратора = ТипЗнч(Регистратор);
				Если ТипРегистратора = Тип("ДокументСсылка.ТрансформационнаяКорректировка") Тогда
					НаименованиеОперации = СтрШаблон(Нстр("ru = 'Транс.корр. №%1 от %2'"), Регистратор.Номер, 
						Формат(Регистратор.Дата, Нстр("ru = 'ДФ=dd.MM.yyyy'")));
				ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.Трансляция") Тогда
					НаименованиеОперации = СтрШаблон(Нстр("ru = 'Транс. №%1 от %2'"), Регистратор.Номер, 
						Формат(Регистратор.Дата, Нстр("ru = 'ДФ=dd.MM.yyyy'")));
				ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗначенийПоказателей") Тогда
					НаименованиеОперации = СтрШаблон(Нстр("ru = 'Корректировка №%1 от %2'"), Регистратор.Номер, 
						Формат(Регистратор.Дата, Нстр("ru = 'ДФ=dd.MM.yyyy'")));
				Иначе
					НаименованиеОперации = Регистратор;
				КонецЕсли;
				ОформитьЯчейку(ТекОбласть, НаименованиеОперации, ЦветКорректировки, ШиринаКолонки, 0,,Ложь);
			Иначе
				НаименованиеОперации = ?(ЗначениеЗаполнено(ТекСтрока), ТекСтрока.НаименованиеОперации, "");
				ОформитьЯчейку(ТекОбласть, НаименованиеОперации, ЦветКорректировки, ШиринаКолонки, 0);
			КонецЕсли;
			
			ТекОбласть.Расшифровка = Регистратор;
			СоответствиеРасположениеКорректировок.Вставить(Строка.Версия, ТекОбласть.Лево);
		Иначе
			
			ТекОбласть.Текст = Строка.Ссылка;
			ОформитьЯчейку(ТекОбласть, Строка.Ссылка, ЦветВидОперации, ШиринаКолонки, 0);
			СоответствиеРасположениеКорректировок.Вставить(Строка.Ссылка, ТекОбласть.Лево);
			
			Старт = НачалоВывода;
			ВывестиДеревоВидовОпераций(Строка.Строки, НачалоВывода, ТабличныйДокумент, ТаблицаЗначений);
			
			Если НачалоВывода > Старт Тогда
				НоваяСтрока = ТаблицаГруппировок.Добавить();
				НоваяСтрока.Начало = Старт;
				НоваяСтрока.Конец  = НачалоВывода;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПоказателей(ВидОтчета)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПоказателиОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &ВидОтчета";
	
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	
	Отчет.СписокПоказателей.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	
	
Конецпроцедуры // ПолучитьСписокПоказателей(

// Процедура получает итоговую таблицу для отчета и отображает отчет.
//
&НаСервере
Процедура ЗаполнитьТаблицу() Экспорт
	
	МассивРеквизитов=Новый Массив;
	МассивРеквизитов.Добавить("Организация");
	МассивРеквизитов.Добавить("ВидОтчета");
	МассивРеквизитов.Добавить("Сценарий");
	МассивРеквизитов.Добавить("ОсновнаяВалюта");
	МассивРеквизитов.Добавить("Проект");
	
	Для Индекс=1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		
		МассивРеквизитов.Добавить("Аналитика"+Индекс);
		
	КонецЦикла;
	
	СтруктураПараметров=ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.ЭкземплярОтчета,МассивРеквизитов);
	
	ВидОтчета=СтруктураПараметров.ВидОтчета;
	АналитикВидаОтчета=ОбщегоНазначенияУХ.ВернутьКоличествоАналитикНаУровнеОтчета(ВидОтчета);
	ИмяТаблицыСинтетики=?(АналитикВидаОтчета=0,"ЗначенияПоказателейОтчетовСинтетика","ЗначенияПоказателейОтчетов"+АналитикВидаОтчета);
	ОсновнаяВалюта=СтруктураПараметров.ОсновнаяВалюта;
	
	Если Отчет.СписокПоказателей.Количество()=0 Тогда
		
		ПолучитьСписокПоказателей(ВидОтчета);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияПоказателейОтчетов.Значение КАК ЗначениеЧисло,
	|	ЗначенияПоказателейОтчетов.Значение КАК Значение,
	|	ВерсииЗначенийПоказателей.Регистратор КАК Регистратор,
	|	ЗначенияПоказателейОтчетов.Показатель.ТипЗначения КАК ТипЗначения,
	|	ВерсииЗначенийПоказателей.Регистратор.Дата КАК РегистраторДата,
	|	ЗначенияПоказателейОтчетов.Версия КАК Версия,
	|	ОписаниеВерсий.Автор КАК Автор,
	|	ОписаниеВерсий.Дата КАК ДатаВерсии,
	|	ВЫБОР
	|		КОГДА НЕ Трансляция.ВидОперации ЕСТЬ NULL
	|			ТОГДА Трансляция.ВидОперации
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ТрансформационнаяКорректировка.ВидОперации ЕСТЬ NULL
	|					ТОГДА ТрансформационнаяКорректировка.ВидОперации
	|				ИНАЧЕ NULL
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ВерсииЗначенийПоказателей.Регистратор ССЫЛКА Документ.НастраиваемыйОтчет
	|			ТОГДА ИСТИНА
	|	КОНЕЦ КАК ПризнакВерсии,
	|	ЗначенияПоказателейОтчетов.Показатель КАК Показатель,
	|	ЗначенияПоказателейОтчетов.Показатель.Наименование КАК НаименованиеПоказателя,
	|	ЗначенияПоказателейОтчетов.Показатель.ВидПоказателя КАК ВидПоказателя,
	|	ЗначенияПоказателейОтчетов.Показатель.СпособОбработки КАК СпособОбработки
	|ИЗ
	|	РегистрСведений."+ИмяТаблицыСинтетики+" КАК ЗначенияПоказателейОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииЗначенийПоказателей КАК ВерсииЗначенийПоказателей
	|		ПО (ВерсииЗначенийПоказателей.Ссылка = ЗначенияПоказателейОтчетов.Версия)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОписаниеВерсий КАК ОписаниеВерсий
	|		ПО (ОписаниеВерсий.Ссылка = ВерсииЗначенийПоказателей.Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Трансляция КАК Трансляция
	|		ПО (ВерсииЗначенийПоказателей.Регистратор = Трансляция.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТрансформационнаяКорректировка КАК ТрансформационнаяКорректировка
	|		ПО (ВерсииЗначенийПоказателей.Регистратор = ТрансформационнаяКорректировка.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗначенийПоказателей КАК КорректировкаЗначенийПоказателей
	|		ПО (ВерсииЗначенийПоказателей.Регистратор = КорректировкаЗначенийПоказателей.Ссылка)
	|ГДЕ
	|	ЗначенияПоказателейОтчетов.Показатель В(&Показатель)
	|	И ВерсииЗначенийПоказателей.ПериодОтчета = &ПериодОтчета
	|	И НЕ ВерсииЗначенийПоказателей.ЧерноваяВерсия";
	
	Для Каждого КлючИЗначение ИЗ СтруктураПараметров Цикл
		
		Если КлючИЗначение.Ключ="ОсновнаяВалюта" Тогда
			
			Запрос.Текст=Запрос.Текст+"
			|И	ВерсииЗначенийПоказателей.Валюта = &ОсновнаяВалюта";
			
		Иначе
			
			Запрос.Текст=Запрос.Текст+"
			|И	ВерсииЗначенийПоказателей."+КлючИЗначение.Ключ+" = &"+КлючИЗначение.Ключ;
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		
	КонецЦикла;	
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО  ЗначенияПоказателейОтчетов.Показатель, Версия";

	Запрос.УстановитьПараметр("ЭкземплярОтчета", Отчет.ЭкземплярОтчета);
	Запрос.УстановитьПараметр("ПериодОтчета", Отчет.тПериод);
	Запрос.УстановитьПараметр("Показатель",  Отчет.СписокПоказателей.ВыгрузитьЗначения());
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ТаблДок = Новый ТабличныйДокумент;
	

	ТаблицаГруппировок = Новый ТаблицаЗначений;
	
	ТаблицаГруппировок.Колонки.Добавить("Начало");
	ТаблицаГруппировок.Колонки.Добавить("Конец");
	
	ТаблицаВерсий = ТаблицаЗначений.Скопировать(, "Версия");
	ТаблицаВерсий.Свернуть("Версия");
	ТаблицаВерсий.Сортировать("Версия");
	                                  
	ТаблицаКорректировок = ТаблицаЗначений.Скопировать(Новый Структура("ПризнакВерсии", Истина), "РегистраторДата,Версия, ПризнакВерсии");
	ТаблицаКорректировок.Свернуть("Версия, ПризнакВерсии");
	ТаблицаКорректировок.Сортировать("Версия");
	
	СписокВерсий=Новый СписокЗначений;
	СписокВерсий.ЗагрузитьЗначения(ТаблицаКорректировок.ВыгрузитьКолонку("Версия"));
	СписокВерсий.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Если СписокВерсий.Количество()>0 Тогда
		ПоследняяВерсия=СписокВерсий[0].Значение;
	Иначе
		ПоследняяВерсия="";
	КонецЕсли;
	
	ТаблицаИтоговыхЗначений=ТаблицаЗначений.СкопироватьКолонки("Показатель,НаименованиеПоказателя, ВидПоказателя, ТипЗначения,СпособОбработки,Значение");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ПОМЕСТИТЬ ТаблицаИтоговыхЗначений
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник";
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаЗначений);
	Запрос.Выполнить();
	
	// Получаем таблицу итоговых значений для числовых показателей
	Запрос.Текст="ВЫБРАТЬ
	|Показатель
	|, Показатель.Наименование КАК НаименованиеПоказателя
	|, Показатель.ВидПоказателя КАК ВидПоказателя
	|, ТипЗначения,
	|СУММА(ЗначениеЧисло) КАК Значение
	|ИЗ ТаблицаИтоговыхЗначений КАК ВТ
	|ГДЕ ВТ.ТипЗначения=&ЗначениеЧисло 
	|СГРУППИРОВАТЬ ПО
	|Показатель,ТипЗначения";
	
	Запрос.УстановитьПараметр("ЗначениеЧисло",Перечисления.ТипыЗначенийПоказателейОтчетов.Число);
	
	// Добавление итоговых значений числовых показателей в таблицу итоговых значений.
	ОбщегоНазначенияУХ.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(),ТаблицаИтоговыхЗначений);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОпераций.Ссылка КАК Ссылка,
		|	ВТ.Показатель КАК Показатель,
		|	ВТ.Версия КАК Версия,
		|	ВТ.ЗначениеЧисло КАК ЗначениеЧисло,
		|	3 КАК Поле1
		|ИЗ
		|	ТаблицаИтоговыхЗначений КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций КАК ВидыОпераций
		|		ПО ВТ.ВидОперации = ВидыОпераций.Ссылка
		|ГДЕ
		|	ВТ.Регистратор ССЫЛКА Документ.КорректировкаЗначенийПоказателей
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыОпераций.Ссылка,
		|	ВТ.Показатель,
		|	ВТ.Версия,
		|	ВТ.ЗначениеЧисло,
		|	1
		|ИЗ
		|	ТаблицаИтоговыхЗначений КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций КАК ВидыОпераций
		|		ПО ВТ.ВидОперации = ВидыОпераций.Ссылка
		|ГДЕ
		|	ВТ.Регистратор ССЫЛКА Документ.ТрансформационнаяКорректировка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыОпераций.Ссылка,
		|	ВТ.Показатель,
		|	ВТ.Версия,
		|	ВТ.ЗначениеЧисло,
		|	2
		|ИЗ
		|	ТаблицаИтоговыхЗначений КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций КАК ВидыОпераций
		|		ПО ВТ.ВидОперации = ВидыОпераций.Ссылка
		|ГДЕ
		|	ВТ.Регистратор ССЫЛКА Документ.Трансляция
		|ИТОГИ
		|	СУММА(ЗначениеЧисло)
		|ПО
		|	Показатель,
		|	Ссылка ИЕРАРХИЯ,
		|	Версия";
	   
	ДеревоПоказателей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОпераций.Ссылка КАК Ссылка,
		|	ВТ.Версия КАК Версия
		|ИЗ
		|	ТаблицаИтоговыхЗначений КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций КАК ВидыОпераций
		|		ПО ВТ.ВидОперации = ВидыОпераций.Ссылка
		|ГДЕ
		|	(ВТ.Регистратор ССЫЛКА Документ.ТрансформационнаяКорректировка
		|			ИЛИ ВТ.Регистратор ССЫЛКА Документ.Трансляция
		|			ИЛИ ВТ.Регистратор ССЫЛКА Документ.КорректировкаЗначенийПоказателей)
		|ИТОГИ ПО
		|	Ссылка ИЕРАРХИЯ,
		|	Версия";
	
	ДеревоВидовОпераций = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	// Получаем таблицу итоговых значений для не числовых показателей
	Запрос.Текст="ВЫБРАТЬ
	|Показатель, НаименованиеПоказателя, ВидПоказателя, ТипЗначения,
	|Значение КАК Значение
	|ИЗ ТаблицаИтоговыхЗначений КАК ВТ
	|ГДЕ (НЕ ВТ.ТипЗначения=&ЗначениеЧисло)
	|И ВТ.Версия=&ПоследняяВерсия";
	
	Запрос.УстановитьПараметр("ЗначениеЧисло",Перечисления.ТипыЗначенийПоказателейОтчетов.Число);
	Запрос.УстановитьПараметр("ПоследняяВерсия",ПоследняяВерсия);
	
	ОбщегоНазначенияУХ.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(),ТаблицаИтоговыхЗначений);
	
	СтруктураОтбора = Новый Структура("Показатель, Версия");
	ТекПоказатель = Неопределено;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ЦветВерсии  = Новый Цвет(122, 222, 187);
	ЦветКорректировки = Новый Цвет(222, 200, 200);
	ЦветВидОперации   = Новый Цвет(222, 125, 125);
	Цвет  = Новый Цвет(222, 222, 222);
	
	ЦветФонаОбластиЗаполняемогоПоказателя	= Новый Цвет(255, 255, 255);
	ЦветФонаОбластиВычисляемогоПоказателя	= Новый Цвет(192, 220, 192);	
	
	Макет = Отчеты.ОтчетОКорректировках.ПолучитьМакет("Макет");
	
	ШиринаКолонки = Макет.Область("ЗаголовокВерсия").ШиринаКолонки;
	
	ОбластьЗаголовкаОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовкаОтчета.Параметры.Заполнить(Отчет.ЭкземплярОтчета);
	ОбластьЗаголовкаОтчета.Параметры.ПериодОтчета  = Отчет.тПериод;
	ТаблДок.Вывести(ОбластьЗаголовкаОтчета).Имя = "ОбластьЗаголовка";
	
	Если ЗначениеЗаполнено(Отчет.ЭкземплярОтчета.Проект) Тогда
		
		ОбластьПроект = Макет.ПолучитьОбласть("ОбластьПроект");
		ОбластьПроект.Параметры.Проект=Отчет.ЭкземплярОтчета.Проект;
		ТаблДок.Вывести(ОбластьПроект).Имя = "ОбластьПроект";
		
	КонецЕсли;	

	ТаблДок.Вывести(Макет.ПолучитьОбласть("ЗаголовокПоказатель"));
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокВерсия");
	
	ТабДокЗаголовок  = Новый ТабличныйДокумент;
	
	ОбластьЗаголовка = ТабДокЗаголовок.Область(1, 1, 2, 1);
	ОбластьЗаголовка.Объединить();
	ОформитьЯчейку(ОбластьЗаголовка, Нстр("ru = 'Исходное значение'"), Цвет, ШиринаКолонки, 0);
	
	Для Инд = 1 По  ТаблицаКорректировок.Количество() - 1 Цикл
		
		ОбластьЗаголовка = ТабДокЗаголовок.Область(2, 1 + Инд, 2, 1 + Инд);
		ДокументРегистратор = ТаблицаКорректировок[Инд].Версия.Регистратор;
		Если ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.НастраиваемыйОтчет") Тогда
			ОформитьЯчейку(ОбластьЗаголовка
						   , ?(ТаблицаКорректировок[Инд].ПризнакВерсии, СтрШаблон(Нстр("ru = 'Версия: %1'"), 
						   	ТаблицаКорректировок[Инд].Версия), ТаблицаКорректировок[Инд].НаименованиеОперации)
			               , ?(ТаблицаКорректировок[Инд].ПризнакВерсии, ЦветВерсии, ЦветКорректировки)
						   , ШиринаКолонки
						   , 0);
			ОбластьЗаголовка.Расшифровка = ТаблицаКорректировок[Инд].Версия;
		Иначе
			ОформитьЯчейку(ОбластьЗаголовка
						   , Строка(ДокументРегистратор)
			               , ?(ТаблицаКорректировок[Инд].ПризнакВерсии, ЦветВерсии, ЦветКорректировки)
						   , ШиринаКолонки
						   , 0);
			ОбластьЗаголовка.Расшифровка = ДокументРегистратор;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаКорректировок.Количество() > 1 Тогда
		
		ОбластьЗаголовка = ТабДокЗаголовок.Область(1, 2, 1, ТаблицаКорректировок.Количество());
		ОбластьЗаголовка.Объединить();
		ОФормитьЯчейку(ОбластьЗаголовка, Нстр("ru = 'Версии'"), Цвет, ШиринаКолонки, 0);
		
	КонецЕсли;
	
	СоответствиеРасположениеКорректировок = Новый Соответствие;
	НачалоВывода = ТаблицаКорректировок.Количество() + 1;
	ВывестиДеревоВидовОпераций(ДеревоВидовОпераций.Строки, НачалоВывода, ТабДокЗаголовок, ТаблицаЗначений);
	
	ОбластьЗаголовка = ТабДокЗаголовок.Область(1, НачалоВывода, 2, НачалоВывода);
	ОбластьЗаголовка.Объединить();
	
	ОформитьЯчейку(ОбластьЗаголовка, Нстр("ru = 'Итоговое значение'"), Цвет, ШиринаКолонки, 0);
	
	ТаблДок.Присоединить(ТабДокЗаголовок).ШиринаКолонки = ШиринаКолонки;
	
	ОбластьТаблицаАналитика     = Макет.ПолучитьОбласть("ТаблицаАналитика");
	ОбластьТаблицаЗначение      = Макет.ПолучитьОбласть("ТаблицаЗначение");
	
	НачалоЗоныКорректировок = ТаблицаКорректировок.Количество() + 1;
	
	Для Каждого Запись Из Отчет.СписокПоказателей Цикл
		
		СтрокаИтоговогоЗначения = ТаблицаИтоговыхЗначений.Найти(Запись.Значение, "Показатель");
		Если СтрокаИтоговогоЗначения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьАналитика = ОбластьТаблицаАналитика;
		ОбластьАналитика.Параметры.Показатель = СтрокаИтоговогоЗначения.НаименованиеПоказателя;
		ОбластьАналитика.Параметры.ПоказательСсылка = СтрокаИтоговогоЗначения.Показатель;
	
		ТекущийЦветФона=ЦветФонаОбластиЗаполняемогоПоказателя;
		
		Для Каждого Область ИЗ ОбластьАналитика.Области Цикл
			
			Область.ЦветФона=ТекущийЦветФона;
			
		КонецЦикла;
		
		ОбластьВывода = ТаблДок.Вывести(ОбластьАналитика);
		РядВывода = ОбластьВывода.Верх;
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаИтоговогоЗначения);
		
		Инд = 0;
		
		Для Каждого СтрокаВерсия Из ТаблицаКорректировок Цикл
			
			СтруктураОтбора.Версия = СтрокаВерсия.Версия;
			
			НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				
				ОбластьЗначение = ОбластьТаблицаЗначение;
				ОбластьЗначение.Параметры.Значение    = НайденныеСтроки[0].Значение;
								
				Структура = Новый Структура("Показатель, Расшифровка,Регистратор,ПризнакВерсии");
				
				Если ПустаяСтрока(СтрокаВерсия.Версия) Тогда
					Структура.Расшифровка = НайденныеСтроки[0].Регистратор;
				Иначе
					Структура.Расшифровка = СтрокаВерсия.Версия;
				КонецЕсли;
				
				Структура.Показатель = НайденныеСтроки[0].Показатель;
				Структура.Регистратор=НайденныеСтроки[0].Регистратор;
				Структура.ПризнакВерсии=НайденныеСтроки[0].ПризнакВерсии;
				
				ОбластьЗначение.Параметры.Расшифровка = Структура;
			Иначе
				ОбластьЗначение = ОбластьТаблицаЗначение;
				ОбластьЗначение.Параметры.Значение = " - ";
			КонецЕсли;
			
			Для Каждого Область ИЗ ОбластьЗначение.Области Цикл
				
				Область.ЦветФона=ТекущийЦветФона;
				
			КонецЦикла;
					
			ОбластьВерсии = ТаблДок.Присоединить(ОбластьЗначение);
			ОбластьВерсии.ШиринаКолонки = ШиринаКолонки;
			
			Если ПустаяСтрока(СтрокаВерсия.Версия) Тогда
				ОбластьВерсии.Шрифт = Новый Шрифт(ОбластьВерсии.Шрифт, , , Истина);
				Если ЗначениеЗаполнено(СтрокаИтоговогоЗначения.ВидПоказателя) Тогда
					ОбластьВерсии.Объединить();
					ОбластьВерсии.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
					ОбластьВерсии.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НачалоВывода > НачалоЗоныКорректировок Тогда
			
			ОбластьЗначение = ОбластьТаблицаЗначение;			
			ОбластьЗначение.Параметры.Значение = "-";
			ОбластьЗначение.Параметры.Расшифровка = Неопределено;
				
			Для Инд = НачалоЗоныКорректировок + 1 ПО НачалоВывода Цикл
				ТекОбл = ТаблДок.Присоединить(ОбластьЗначение);
				ТекОбл.ЦветФона = ТекущийЦветФона;
			КонецЦикла;
			
			ТекСтрока = ДеревоПоказателей.Строки.Найти(СтрокаИтоговогоЗначения.Показатель, "Показатель");
			
			Если ТекСтрока <> Неопределено Тогда
				ВывестиДеревоОпераций(?(СтрокаИтоговогоЗначения.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число
										, СтрокаИтоговогоЗначения.ВидПоказателя
										, Неопределено), ТекСтрока.Строки, РядВывода, ТаблДок, ТекущийЦветФона);
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьЗначение = ОбластьТаблицаЗначение;
			
		ОбластьЗначение.Параметры.Значение = СтрокаИтоговогоЗначения.Значение;
		ОбластьВерсии = ТаблДок.Присоединить(ОбластьЗначение);

		Если ЗначениеЗаполнено(СтрокаИтоговогоЗначения.ВидПоказателя) Тогда
			ОбластьВерсии.Объединить();
		КонецЕсли;
		
		ОбластьВерсии.ШиринаКолонки = ШиринаКолонки;
		ОбластьВерсии.Шрифт = Новый Шрифт(ОбластьВерсии.Шрифт, , , Истина);
			
	КонецЦикла;
		
	Если ТаблицаГруппировок.Количество() > 0 Тогда
		Для Каждого Строка Из ТаблицаГруппировок Цикл
			ТаблДок.Область(, Строка.Начало + 2, , Строка.Конец + 1).Сгруппировать();
		КонецЦикла;
	КонецЕсли;

	ПолеТабличногоДокументаОтчет.Вывести(ТаблДок);
	
	ПолеТабличногоДокументаОтчет.ФиксацияСверху = 9;
	ПолеТабличногоДокументаОтчет.ФиксацияСлева  = 2;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ЭкземплярОтчета) Тогда
		ВызватьИсключение НСтр("ru = 'Отчет не предназначен для самостоятельного открытия пользователем.'");
	КонецЕсли;
	
	Отчет.ЭкземплярОтчета 		= Параметры.ЭкземплярОтчета;
	Отчет.СписокПоказателей 	= Параметры.СписокПоказателей;
	Если ЗначениеЗаполнено(Параметры.тПериод) Тогда
		Отчет.тПериод =  Параметры.тПериод;
	Иначе	
		Отчет.тПериод =  Параметры.ЭкземплярОтчета.ПериодОтчета;
	КонецЕсли;
	
	МногопериодныйРежим=Параметры.МногопериодныйРежим;
	ТекущийБланк=Параметры.ТекущийБланк;
	
	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьРегистратор(ВерсияЗначения)
	Если ТипЗнч(ВерсияЗначения) = Тип("СправочникСсылка.ВерсииЗначенийПоказателей") Тогда
		Возврат ВерсияЗначения.Регистратор;
	КонецЕсли;
	
	Возврат ВерсияЗначения;
КонецФункции

&НаКлиенте
Процедура ПолеТабличногоДокументаОтчетОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем Регистратор;
	Перем Показатель;
	Перем ПризнакВерсии;
	
	Если Не ТипЗнч(Расшифровка)=Тип("Структура") Тогда
		
		Возврат;
			
	КонецЕсли;
	
	Расшифровка.Свойство("Регистратор",Регистратор);
	Расшифровка.Свойство("Показатель",Показатель);
	Расшифровка.Свойство("ПризнакВерсии",ПризнакВерсии);

	
	СтандартнаяОбработка=Ложь;
	
	Если ЗначениеЗаполнено(Показатель) 
		И ЗначениеЗаполнено(ПризнакВерсии)
		И ПризнакВерсии=Истина Тогда
		
		СписокВерсий=Новый СписокЗначений;
		СписокВерсий.Добавить(Расшифровка.Расшифровка);
		
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("АдресВременногоХранилищаОбъекта",ДокументОбъектАдрес);
		СтруктураПараметров.Вставить("СозданаВФормеГрупповогоРедактирования",Ложь);
		СтруктураПараметров.Вставить("ВозможноРедактирование",Ложь);
		СтруктураПараметров.Вставить("СрезПоВерсиям",Истина);
		СтруктураПараметров.Вставить("ВалютаОтображения",ОсновнаяВалюта);
		СтруктураПараметров.Вставить("мТекущаяВалюта",ОсновнаяВалюта);
			
		СтруктураПараметров.Вставить("СписокВерсий",СписокВерсий);	
		
		Если МногопериодныйРежим Тогда
			
			СтруктураПараметров.Вставить("СозданаВФормеГрупповогоРедактирования",Истина);
			
			СписокВерсийДоТекущей=ПолучитьСписокВерсийДоТекущей(Расшифровка.Расшифровка);
			
			СтруктураПараметров.Вставить("Бланк",ТекущийБланк);	   		
			СтруктураПараметров.Вставить("ЭкземплярОтчета",Отчет.ЭкземплярОтчета);	
			СтруктураПараметров.Вставить("СписокВерсий",СписокВерсийДоТекущей);
			Оповещение = Новый ОписаниеОповещения("ОткрытьВерсиюДокументаЗавершение", ЭтотОбъект);
			ИмяФормыБланка = "Обработка.АналитическийБланк.Форма.ФормаОтчета";
			ОткрытьФорму(ИмяФормыБланка, СтруктураПараметров,,,,,Оповещение,РежимОткрытияОкнаФормы.Независимый);	
		Иначе	
			Оповещение = Новый ОписаниеОповещения("ОткрытьВерсиюДокументаЗавершение", ЭтотОбъект);
			ОткрытьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта", СтруктураПараметров,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
			
	Иначе
		
		ПоказатьЗначение(, ВернутьРегистратор(Расшифровка.Расшифровка));
				
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВерсиюДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	АдресИзмененногоОбъекта = Результат;	
КонецПроцедуры // ОткрытьФормуОтчета()


&НаСервереБезКонтекста
Функция ПолучитьСписокВерсийДоТекущей(Версия)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ОписаниеВерсий.Аналитика1 КАК Аналитика1,
	|	ОписаниеВерсий.Аналитика2 КАК Аналитика2,
	|	ОписаниеВерсий.Аналитика3 КАК Аналитика3,
	|	ОписаниеВерсий.Аналитика4 КАК Аналитика4,
	|	ОписаниеВерсий.Аналитика5 КАК Аналитика5,
	|	ОписаниеВерсий.Аналитика6 КАК Аналитика6,
	|	ОписаниеВерсий.ВидОтчета КАК ВидОтчета,
	|	ОписаниеВерсий.Организация КАК Организация,
	|	ОписаниеВерсий.ПериодОтчета КАК ПериодОтчета,
	|	ОписаниеВерсий.Проект КАК Проект,
	|	ОписаниеВерсий.Сценарий КАК Сценарий,
	|	ОписаниеВерсий.Код КАК Код
	|ПОМЕСТИТЬ ТабТекущаяВерсия
	|ИЗ
	|	Справочник.ОписаниеВерсий КАК ОписаниеВерсий
	|ГДЕ
	|	ОписаниеВерсий.Ссылка = &ОписаниеВерсий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписаниеВерсий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОписаниеВерсий КАК ОписаниеВерсий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабТекущаяВерсия КАК ТабТекущаяВерсия
	|		ПО ОписаниеВерсий.ВидОтчета = ТабТекущаяВерсия.ВидОтчета
	|			И ОписаниеВерсий.Организация = ТабТекущаяВерсия.Организация
	|			И ОписаниеВерсий.ПериодОтчета = ТабТекущаяВерсия.ПериодОтчета
	|			И ОписаниеВерсий.Сценарий = ТабТекущаяВерсия.Сценарий
	|			И ОписаниеВерсий.Проект = ТабТекущаяВерсия.Проект
	|			И ОписаниеВерсий.Аналитика1 = ТабТекущаяВерсия.Аналитика1
	|			И ОписаниеВерсий.Аналитика2 = ТабТекущаяВерсия.Аналитика2
	|			И ОписаниеВерсий.Аналитика3 = ТабТекущаяВерсия.Аналитика3
	|			И ОписаниеВерсий.Аналитика4 = ТабТекущаяВерсия.Аналитика4
	|			И ОписаниеВерсий.Аналитика5 = ТабТекущаяВерсия.Аналитика5
	|			И ОписаниеВерсий.Аналитика6 = ТабТекущаяВерсия.Аналитика6
	|			И ОписаниеВерсий.Код <= ТабТекущаяВерсия.Код";
	
	Запрос.УстановитьПараметр("ОписаниеВерсий",Версия.Владелец);
	
	СписокВерсий=Новый СписокЗначений;
	СписокВерсий.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокВерсий;
	
	
КонецФункции // ПолучитьСписокВерсийДоТекущей() 


&НаКлиенте
Процедура ПолеТабличногоДокументаОтчетОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
